; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared1 - mode
	thermograph0 - mode
	image7 - mode
	thermograph6 - mode
	spectrograph3 - mode
	infrared2 - mode
	infrared5 - mode
	spectrograph4 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image7)
	(supports instrument0 infrared5)
	(supports instrument0 thermograph6)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 infrared5)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(have_image Star5 spectrograph4)
	(have_image Star5 spectrograph3)
	(have_image Planet6 spectrograph3)
	(have_image Planet6 image7)
	(have_image Planet7 infrared1)
	(have_image Planet7 infrared5)
	(have_image Phenomenon8 infrared5)
	(have_image Phenomenon8 thermograph6)
	(have_image Star9 thermograph0)
	(have_image Star9 thermograph6)
	(have_image Planet10 thermograph0)
	(have_image Planet11 infrared2)
	(have_image Planet11 infrared5)
	(have_image Phenomenon12 image7)
	(have_image Phenomenon12 spectrograph3)
	(have_image Planet13 spectrograph4)
))

)

; plan
1. (turn_to satellite1 groundstation0 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 16
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 16
3. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 16
4. (turn_to satellite1 star5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star5)
   goals met: 0 of 16
5. (take_image satellite1 star5 instrument2 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 1 of 16
6. (turn_to satellite1 planet13 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet13)
   goals met: 1 of 16
7. (take_image satellite1 planet13 instrument2 spectrograph4)
   added: (have_image planet13 spectrograph4)
   goals met: 2 of 16
8. (turn_to satellite1 planet11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet11)
   goals met: 2 of 16
9. (take_image satellite1 planet11 instrument2 infrared5)
   added: (have_image planet11 infrared5)
   goals met: 3 of 16
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 16
11. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 3 of 16
12. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 3 of 16
13. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 16
14. (turn_to satellite0 phenomenon12 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 16
15. (take_image satellite0 phenomenon12 instrument0 image7)
   added: (have_image phenomenon12 image7)
   goals met: 4 of 16
16. (turn_to satellite0 phenomenon8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 16
17. (take_image satellite0 phenomenon8 instrument0 infrared5)
   added: (have_image phenomenon8 infrared5)
   goals met: 5 of 16
18. (take_image satellite0 phenomenon8 instrument0 thermograph6)
   added: (have_image phenomenon8 thermograph6)
   goals met: 6 of 16
19. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 6 of 16
20. (take_image satellite0 planet10 instrument0 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 7 of 16
21. (turn_to satellite0 planet6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet6)
   goals met: 7 of 16
22. (take_image satellite0 planet6 instrument0 image7)
   added: (have_image planet6 image7)
   goals met: 8 of 16
23. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 8 of 16
24. (take_image satellite0 planet7 instrument0 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 9 of 16
25. (take_image satellite0 planet7 instrument0 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 10 of 16
26. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 10 of 16
27. (take_image satellite0 star9 instrument0 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 11 of 16
28. (take_image satellite0 star9 instrument0 thermograph6)
   added: (have_image star9 thermograph6)
   goals met: 12 of 16
29. (turn_to satellite1 groundstation4 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation4)
   goals met: 12 of 16
30. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 12 of 16
31. (turn_to satellite1 phenomenon12 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon12)
   goals met: 12 of 16
32. (take_image satellite1 phenomenon12 instrument1 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 13 of 16
33. (turn_to satellite1 planet11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet11)
   goals met: 13 of 16
34. (take_image satellite1 planet11 instrument1 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 14 of 16
35. (turn_to satellite1 planet6 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet6)
   goals met: 14 of 16
36. (take_image satellite1 planet6 instrument1 spectrograph3)
   added: (have_image planet6 spectrograph3)
   goals met: 15 of 16
37. (turn_to satellite1 star5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star5)
   goals met: 15 of 16
38. (take_image satellite1 star5 instrument1 spectrograph3)
   added: (have_image star5 spectrograph3)
   goals met: 16 of 16
